zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_dma.c
  /* Get channel lock attribute state */
  *pLockState = ((p_dma_instance->RCFGLOCKR & channel_idx) == 0U) ? DMA_CHANNEL_ATTRIBUTE_UNLOCKED : \
                DMA_CHANNEL_ATTRIBUTE_LOCKED;

  return HAL_OK;
}
/**
  * @brief  Attempt to acquire semaphore(s) of DMA Channel
  * @note   In case of semaphore acquisition failure, returned status is HAL_KO and semaphore acquisition is abandoned
  * @param  hdma : pointer to DMA Handler
  * @retval HAL Status, HAL_OK if semaphore acquisition is successful
  */

HAL_StatusTypeDef HAL_DMA_TakeChannelSemaphore(DMA_HandleTypeDef *hdma)
{
  uint32_t cidcurrent;

  /* Check the DMA peripheral handle */
  if (hdma == NULL)
  {
    return HAL_ERROR;
  }

#if defined(CORE_CM0PLUS)
  cidcurrent = RIF_CID_CPU3_CM0;
#endif /* CORE_CM0PLUS */
#if defined(CORE_CM33)
  cidcurrent = RIF_CID_CPU2_CM33;
#endif /* CORE_CM33 */
#if defined(CORE_CA35)
  cidcurrent = RIF_CID_CPU1_CA35;
#endif /* CORE_CA35 */

  /* Take Semaphore */
  hdma->Instance->CSEMCR |= DMA_CSEMCR_SEMMUTEX;
  if ((hdma->Instance->CSEMCR & DMA_CSEMCR_SEMCCID_Msk) != (cidcurrent << DMA_CSEMCR_SEMCCID_Pos))
  {
    /* Mutex not taken with current CID - it means that other authorized CID has control, previous acquired
       semaphore shall be released and status error is returned
    */
    (void)HAL_DMA_ReleaseChannelSemaphore(hdma);

    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Release semaphore(s) of DMA Channel
  * @param  hdma : pointer to DMA Handler
  * @retval HAL Status, HAL_OK
  */
HAL_StatusTypeDef HAL_DMA_ReleaseChannelSemaphore(DMA_HandleTypeDef *hdma)
{
  /* Check the DMA peripheral handle */
  if (hdma == NULL)
  {
    return HAL_ERROR;
  }

  /* Release Semaphore*/
  hdma->Instance->CSEMCR &= (~DMA_CSEMCR_SEMMUTEX);

  return HAL_OK;
}
/**
  * @}
  */

/**
  * @}
  */


/* Private functions -------------------------------------------------------------------------------------------------*/
/** @defgroup DMA_Private_Functions DMA Private Functions
  * @brief    DMA Private Functions
  * @{
  */

/**
  * @brief  Set the DMA channel normal transfer parameters.
  * @param  hdma        : Pointer to a DMA_HandleTypeDef structure that contains the configuration information for the
  *                       specified DMA Channel.
  * @param  SrcAddress  : The source data address.
  * @param  DstAddress  : The destination data address.
  * @param  SrcDataSize : The length of data to be transferred from source to destination in bytes.
  * @retval None.
  */
static void DMA_SetConfig(DMA_HandleTypeDef const *const hdma,
                          uint32_t SrcAddress,
                          uint32_t DstAddress,
                          uint32_t SrcDataSize)
{
  /* Configure the DMA channel data size */
  MODIFY_REG(hdma->Instance->CBR1, DMA_CBR1_BNDT, (SrcDataSize & DMA_CBR1_BNDT));

  /* Clear all interrupt flags */
  __HAL_DMA_CLEAR_FLAG(hdma, DMA_FLAG_TC | DMA_FLAG_HT | DMA_FLAG_DTE | DMA_FLAG_ULE | DMA_FLAG_USE | DMA_FLAG_SUSP |
                       DMA_FLAG_TO);

#if (defined(SYSCFG_HPDMAARCR_HPDMA1AREN)||defined(SYSCFG_HPDMAARCR_HPDMA2AREN)||defined(SYSCFG_HPDMAARCR_HPDMA3AREN))
  /* To check syscfg bit is set to 1 and src/dest port is AXI for DMA Master to see 4GB DDR */
  if (((READ_BIT(SYSCFG->HPDMAARCR, SYSCFG_HPDMAARCR_HPDMA1AREN) == SYSCFG_HPDMAARCR_HPDMA1AREN) || \
       (READ_BIT(SYSCFG->HPDMAARCR, SYSCFG_HPDMAARCR_HPDMA2AREN) == SYSCFG_HPDMAARCR_HPDMA2AREN)  || \
       (READ_BIT(SYSCFG->HPDMAARCR, SYSCFG_HPDMAARCR_HPDMA3AREN) == SYSCFG_HPDMAARCR_HPDMA3AREN)) && \
      ((hdma->Init.TransferAllocatedPort & DMA_CTR1_SAP) == DMA_SRC_ALLOCATED_PORT0))
  {
    /* subtracting 0x80000000 from the source/destination address to get the actual address */
    /* Configure DMA channel source address */
    hdma->Instance->CSAR = (SrcAddress - 0x80000000);
  }
  else
  {
    /* Configure DMA channel source address */
    hdma->Instance->CSAR = SrcAddress;
  }
  if (((READ_BIT(SYSCFG->HPDMAARCR, SYSCFG_HPDMAARCR_HPDMA1AREN) == SYSCFG_HPDMAARCR_HPDMA1AREN) || \
       (READ_BIT(SYSCFG->HPDMAARCR, SYSCFG_HPDMAARCR_HPDMA2AREN) == SYSCFG_HPDMAARCR_HPDMA2AREN)  || \
       (READ_BIT(SYSCFG->HPDMAARCR, SYSCFG_HPDMAARCR_HPDMA3AREN) == SYSCFG_HPDMAARCR_HPDMA3AREN)) && \
      ((hdma->Init.TransferAllocatedPort & DMA_CTR1_DAP) == DMA_DEST_ALLOCATED_PORT0))
  {
    /* subtracting 0x80000000 from the source/destination address to get the actual address */
    /* Configure DMA channel destination address */
    hdma->Instance->CDAR = (DstAddress - 0x80000000);
  }
  else
  {
    /* Configure DMA channel destination address */
    hdma->Instance->CDAR = DstAddress;
  }
#else
  /* Configure DMA channel source address */
  hdma->Instance->CSAR = SrcAddress;

  /* Configure DMA channel destination address */
  hdma->Instance->CDAR = DstAddress;
#endif /* SYSCFG_HPDMAARCR_HPDMAxAREN */
}

/**
  * @brief  Initialize the DMA channel in normal mode according to the specified parameters in the DMA_InitTypeDef.
  * @param  hdma : pointer to a DMA_HandleTypeDef structure that contains the configuration information for the
  *                specified DMA Channel.
  * @retval None.
  */
static void DMA_Init(DMA_HandleTypeDef const *const hdma)
{
  uint32_t tmpreg;

  /* Prepare DMA Channel Control Register (CCR) value *****************************************************************/
  tmpreg = hdma->Init.Priority;

  /* Write DMA Channel Control Register (CCR) */
  MODIFY_REG(hdma->Instance->CCR, DMA_CCR_PRIO | DMA_CCR_LAP | DMA_CCR_LSM, tmpreg);

  /* Prepare DMA Channel Transfer Register (CTR1) value ***************************************************************/
  tmpreg = hdma->Init.DestInc | hdma->Init.DestDataWidth | hdma->Init.SrcInc | hdma->Init.SrcDataWidth;

  /* Add parameters specific to HPDMA */
  if (IS_HPDMA_INSTANCE(hdma->Instance) != 0U)
  {
    tmpreg |= (hdma->Init.TransferAllocatedPort                                             |
               (((hdma->Init.DestBurstLength - 1U) << DMA_CTR1_DBL_1_Pos) & DMA_CTR1_DBL_1) |
               (((hdma->Init.SrcBurstLength - 1U) << DMA_CTR1_SBL_1_Pos) & DMA_CTR1_SBL_1));
  }

